{
  "categories": [
    {
      "key": "social-welfare",
      "title": "Social Welfare & Humanitarian Aid",
      "description": "Basic needs, dignity, and social care support programs.",
      "programs": [
       {
  "title": "Free Food Distribution",
  "slug": "free-food-distribution",
  "short": "Providing meals to underprivileged families.",
  "description": "Help us deliver hope and food to people in need by donating to our Food Distribution Program. In order to provide wholesome food to those in need, we frequently offer meals in underprivileged areas, hospitals, and slums.\n\nAny amount you choose to donate, even ₹11, can have a significant impact. Every donation enables us to reach more people and feed the most vulnerable.\n\nParticipate in this act of kindness with us; your help can make someone's day happier and more comfortable. Make a donation now to contribute to the change!",
  "images": [],
  "donation_target": 50000
},

        {
  "title": "Funeral Services",
  "slug": "funeral-services",
  "short": "Respectful and tradition-based funeral support.",
  "description": "We provide funeral services that are adapted to the unique traditions and customs of various religions as part of our dedication to helping people and families through trying times. Our objective is to offer considerate and compassionate support while making sure that all customs and traditions are respected in accordance with the family's values and beliefs.\n\nWe make this difficult moment a little bit easier by handling everything with tact and consideration, from setting up the ceremonies to offering guidance on religious customs. Our staff is committed to helping families through their grieving process while honouring their spiritual and cultural needs at every stage.",
  "images": [],
  "donation_target": 40000
}
,
        {
  "title": "Distributions & Donations",
  "slug": "distributions-and-donations",
  "short": "Supporting communities through essential resources, education, and welfare distributions.",
  "description": "Vidhatha Society’s commitment to community welfare shines through our distributions and donations, which lie at the core of our mission to uplift those in need.\n\nBy reaching out with food donations to streets, hospitals, orphanages, old age homes, and supporting individuals facing hardship, we work tirelessly to reduce hunger and provide crucial aid to vulnerable communities. Collaborating with local organizations and dedicated volunteers, we deliver nutritious meals, clothing, and everyday essentials to ensure everyone can access basic comforts and support.\n\nWe believe that education is a transformative force. Our educational initiatives provide children in need with resources such as notebooks, textbooks, stationery, uniforms, and school bags, enabling them to achieve their academic goals. By removing barriers to learning, we foster brighter futures and help empower the next generation to succeed.\n\nOur social impact extends beyond individuals to environmental and cultural preservation. We distribute native plants, traditional idols, and medicines, promoting sustainability, cultural heritage, and holistic wellness. These actions encourage greener communities and reflect our dedication to long-term, positive change.\n\nSupport our initiatives and help us make a real difference. By joining hands, we can build a more caring, resilient, and inclusive community together.\n\n***\n\n## Sanitary Napkin Distribution\n\nOur sanitary napkin distribution program provides essential menstrual hygiene products to women and girls in underserved areas. By supplying sanitary napkins free of charge or at low cost, we help break the stigma around menstruation, safeguard health, and empower women to lead their lives and continue education or work with confidence and dignity.\n\n***\n\n## Books and Stationery Distribution\n\nOur books and stationery drives ensure that children from low-income families receive vital educational materials—textbooks, notebooks, pens, and pencils. By providing these resources, we help bridge educational gaps, promote literacy, and support children’s academic journeys. Supplying essentials also motivates students to remain engaged in their education and reach their full potential.\n\nWe also organize the distribution of necessities such as books, clothing, food, stationery, school bags, uniforms, sweaters, blankets, and umbrellas—bringing comfort and relief, especially during colder months, to children and families who need it most. These efforts aim to ease financial burdens and ensure everyone has what they need for well-being and educational success.\n\n***\n\n## Celebrate Your Special Occasions\n\nCelebrate your personal milestones—like birthdays and anniversaries—by making a donation to our cause. Your support can provide food, clothes, educational supplies, and other important items to people in need. Transform your special day into an occasion of kindness that brings hope and happiness to many. Donate today and become a part of something truly meaningful!",
  "images": [],
  "donation_target": 60000
}
,
        {
          "title": "Other Programs",
          "slug": "other-programs",
          "short": "Miscellaneous support activities.",
          "description": "Additional welfare activities conducted by Vidhatha Society to support various community needs that arise throughout the year.",
          "images": [],
          "donation_target": 10000
        }
      ]
    },

    {
      "key": "awareness-education",
      "title": "Awareness & Education",
      "description": "Educating communities and spreading awareness.",
      "programs": [
        {
          "title": "Awareness Programs",
          "slug": "awareness-programs",
          "short": "Sessions on safety, human values, and public health.",
          "description": "We conduct awareness sessions in communities and schools covering topics such as hygiene, traffic safety, women’s safety, and general public awareness.",
          "images": [],
          "donation_target": 15000
        },
        {
          "title": "Health Awareness Programs",
          "slug": "health-awareness-programs",
          "short": "Promoting healthy living through informative sessions.",
          "description": "These programs focus on educating people about proper hygiene, preventive healthcare, mental wellness, and nutrition.",
          "images": [],
          "donation_target": 20000
        },
        {
          "title": "Environmental Protection Programs",
          "slug": "environmental-protection-programs",
          "short": "Plantation, clean-up drives, and eco-awareness.",
          "description": "This includes activities such as tree plantation drives, plastic-free campaigns, lake clean-ups, and environment-awareness events.",
          "images": [],
          "donation_target": 18000
        },
        {
          "title": "Culture, Art and Traditional Programs",
          "slug": "culture-art-traditional-programs",
          "short": "Promoting cultural heritage and traditional arts.",
          "description": "We organize cultural events, art competitions, and traditional celebrations to encourage young talent and preserve cultural heritage.",
          "images": [],
          "donation_target": 22000
        }
      ]
    },

    {
      "key": "health-wellbeing",
      "title": "Health & Well-being",
      "description": "Health-related and counseling initiatives.",
      "programs": [
        {
          "title": "Health Programs",
          "slug": "health-programs",
          "short": "Medical camps, check-ups, and health support.",
          "description": "We organize free medical check-up camps, blood donation camps, and provide health assistance to underprivileged families.",
          "images": [],
          "donation_target": 40000
        },
        {
          "title": "Counselling Programs",
          "slug": "counselling-programs",
          "short": "Supporting mental and emotional well-being.",
          "description": "Trained counselors guide individuals facing emotional stress, addictions, and mental health challenges.",
          "images": [],
          "donation_target": 12000
        }
      ]
    },

    {
      "key": "senior-special",
      "title": "Senior & Special Support",
      "description": "Support for elderly and differently-abled individuals.",
      "programs": [
        {
          "title": "Senior Citizen Programs",
          "slug": "senior-citizen-programs",
          "short": "Activities and support for senior citizens.",
          "description": "Programs include health checkups, recreation activities, and assistance for senior citizens living alone.",
          "images": [],
          "donation_target": 20000
        },
        {
          "title": "Disable People Programs",
          "slug": "disable-people-programs",
          "short": "Support for differently-abled citizens.",
          "description": "We extend support like assistive tools, physiotherapy camps, and learning workshops for differently-abled individuals.",
          "images": [],
          "donation_target": 25000
        }
      ]
    },

    {
      "key": "women-youth-child",
      "title": "Women, Youth & Child Empowerment",
      "description": "Empowerment and development programs.",
      "programs": [
        {
          "title": "Women & Child Welfare Programs",
          "slug": "women-child-welfare-programs",
          "short": "Training and assistance for women and children.",
          "description": "We focus on the welfare of women and children through educational support, nutrition awareness, and financial literacy.",
          "images": [],
          "donation_target": 30000
        },
        {
          "title": "Youth Programs",
          "slug": "youth-programs",
          "short": "Educating and engaging the youth.",
          "description": "These programs include skill sessions, leadership training, and motivational activities for the youth.",
          "images": [],
          "donation_target": 18000
        },
        {
          "title": "Skill Development Programs",
          "slug": "skill-development-programs",
          "short": "Training the unemployed to become self-sufficient.",
          "description": "We conduct skill development courses including tailoring, computers, arts & crafts aimed at making individuals job-ready.",
          "images": [],
          "donation_target": 25000
        }
      ]
    },

    {
      "key": "community-rural",
      "title": "Community & Rural Development",
      "description": "Initiatives for better communities and rural progress.",
      "programs": [
        {
          "title": "Rural & Urban Development Programs",
          "slug": "rural-urban-development-programs",
          "short": "Improving infrastructure and supporting rural communities.",
          "description": "Programs include water facility improvement, sanitation awareness, and rural literacy support.",
          "images": [],
          "donation_target": 35000
        },
        {
          "title": "Environmental Protection Programs",
          "slug": "environmental-protection-programs-2",
          "short": "Supporting eco-friendly development.",
          "description": "Additional drives focusing on sustainability, waste reduction, and green lifestyle promotion.",
          "images": [],
          "donation_target": 15000
        }
      ]
    },

    {
      "key": "celebrations-cultural",
      "title": "Celebrations & Cultural Integration",
      "description": "Community bonding through festivals.",
      "programs": [
        {
          "title": "Special Day Celebrations",
          "slug": "special-day-celebrations",
          "short": "Celebrating festivals and important events.",
          "description": "We celebrate special days such as Independence Day, festivals, and cultural events to spread joy and unity.",
          "images": [],
          "donation_target": 10000
        },
        {
          "title": "Culture, Art and Traditional Programs",
          "slug": "culture-art-traditional-programs-2",
          "short": "Preserving arts and traditions.",
          "description": "Events showcasing classical arts, traditional music, and cultural values.",
          "images": [],
          "donation_target": 20000
        }
      ]
    }
  ]
}
