{
  "categories": [
    {
      "key": "social-welfare",
      "title": "Social Welfare & Humanitarian Aid",
      "description": "Basic needs, dignity, and social care support programs.",
      "programs": [
       {
  "title": "Free Food Distribution",
  "slug": "free-food-distribution",
  "short": "Providing meals to underprivileged families.",
  "description": "Help us deliver hope and food to people in need by donating to our Food Distribution Program. In order to provide wholesome food to those in need, we frequently offer meals in underprivileged areas, hospitals, and slums.\n\nAny amount you choose to donate, even ₹11, can have a significant impact. Every donation enables us to reach more people and feed the most vulnerable.\n\nParticipate in this act of kindness with us; your help can make someone's day happier and more comfortable. Make a donation now to contribute to the change!",
  "images": [],
  "donation_target": 50000
},

        {
  "title": "Funeral Services",
  "slug": "funeral-services",
  "short": "Respectful and tradition-based funeral support.",
  "description": "We provide funeral services that are adapted to the unique traditions and customs of various religions as part of our dedication to helping people and families through trying times. Our objective is to offer considerate and compassionate support while making sure that all customs and traditions are respected in accordance with the family's values and beliefs.\n\nWe make this difficult moment a little bit easier by handling everything with tact and consideration, from setting up the ceremonies to offering guidance on religious customs. Our staff is committed to helping families through their grieving process while honouring their spiritual and cultural needs at every stage.",
  "images": [],
  "donation_target": 40000
}
,
        {
  "title": "Distributions & Donations",
  "slug": "distributions-and-donations",
  "short": "Supporting communities through essential resources, education, and welfare distributions.",
  "description": "Vidhatha Society’s commitment to community welfare shines through our distributions and donations, which lie at the core of our mission to uplift those in need.\n\nBy reaching out with food donations to streets, hospitals, orphanages, old age homes, and supporting individuals facing hardship, we work tirelessly to reduce hunger and provide crucial aid to vulnerable communities. Collaborating with local organizations and dedicated volunteers, we deliver nutritious meals, clothing, and everyday essentials to ensure everyone can access basic comforts and support.\n\nWe believe that education is a transformative force. Our educational initiatives provide children in need with resources such as notebooks, textbooks, stationery, uniforms, and school bags, enabling them to achieve their academic goals. By removing barriers to learning, we foster brighter futures and help empower the next generation to succeed.\n\nOur social impact extends beyond individuals to environmental and cultural preservation. We distribute native plants, traditional idols, and medicines, promoting sustainability, cultural heritage, and holistic wellness. These actions encourage greener communities and reflect our dedication to long-term, positive change.\n\nSupport our initiatives and help us make a real difference. By joining hands, we can build a more caring, resilient, and inclusive community together.\n\n***\n\n## Sanitary Napkin Distribution\n\nOur sanitary napkin distribution program provides essential menstrual hygiene products to women and girls in underserved areas. By supplying sanitary napkins free of charge or at low cost, we help break the stigma around menstruation, safeguard health, and empower women to lead their lives and continue education or work with confidence and dignity.\n\n***\n\n## Books and Stationery Distribution\n\nOur books and stationery drives ensure that children from low-income families receive vital educational materials—textbooks, notebooks, pens, and pencils. By providing these resources, we help bridge educational gaps, promote literacy, and support children’s academic journeys. Supplying essentials also motivates students to remain engaged in their education and reach their full potential.\n\nWe also organize the distribution of necessities such as books, clothing, food, stationery, school bags, uniforms, sweaters, blankets, and umbrellas—bringing comfort and relief, especially during colder months, to children and families who need it most. These efforts aim to ease financial burdens and ensure everyone has what they need for well-being and educational success.\n\n***\n\n## Celebrate Your Special Occasions\n\nCelebrate your personal milestones—like birthdays and anniversaries—by making a donation to our cause. Your support can provide food, clothes, educational supplies, and other important items to people in need. Transform your special day into an occasion of kindness that brings hope and happiness to many. Donate today and become a part of something truly meaningful!",
  "images": [],
  "donation_target": 60000
}

,
        {
  "title": "Animal Support Programs",
  "slug": "animal-support-programs",
  "short": "Protecting and caring for stray, injured, and abandoned animals.",
  "description": "Animal support programs are dedicated to promoting the safety, well-being, and humane treatment of animals, including both domestic pets and wildlife.\n\nThese efforts involve rescuing injured or abandoned animals, offering shelter and veterinary care, and encouraging adoption to give animals loving homes.\n\nOrganizations also lead campaigns to raise awareness about responsible pet care, the importance of spaying and neutering, and preventing cruelty toward animals.\n\nIn addition to supporting stray and injured animals, animal welfare initiatives protect wildlife and conserve natural habitats, helping to build a kinder, more compassionate society that values every living creature.",
  "images": [],
  "donation_target": 50000
}

      ]
    },

    {
      "key": "awareness-education",
      "title": "Awareness & Education",
      "description": "Educating communities and spreading awareness.",
      "programs": [
        {
          "title": "Awareness Programs",
          "slug": "awareness-programs",
          "short": "Sessions on safety, human values, and public health.",
          "description": "We conduct awareness sessions in communities and schools covering topics such as hygiene, traffic safety, women’s safety, and general public awareness.",
          "images": [],
          "donation_target": 15000
        },
        {
          "title": "Health Awareness Programs",
          "slug": "health-awareness-programs",
          "short": "Promoting healthy living through informative sessions.",
          "description": "These programs focus on educating people about proper hygiene, preventive healthcare, mental wellness, and nutrition.",
          "images": [],
          "donation_target": 20000
        }
       ]
    },

    {
      "key": "health-wellbeing",
      "title": "Health & Well-being",
      "description": "Health-related and counseling initiatives.",
      "programs": [
        {
          "title": "Health Programs",
          "slug": "health-programs",
          "short": "Medical camps, check-ups, and health support.",
          "description": "We organize free medical check-up camps, blood donation camps, and provide health assistance to underprivileged families.",
          "images": [],
          "donation_target": 40000
        },
        {
          "title": "Counselling Programs",
          "slug": "counselling-programs",
          "short": "Supporting mental and emotional well-being.",
          "description": "Trained counselors guide individuals facing emotional stress, addictions, and mental health challenges.",
          "images": [],
          "donation_target": 12000
        }
      ]
    },

    {
      "key": "senior-special",
      "title": "Senior & Special Support",
      "description": "Support for elderly and differently-abled individuals.",
      "programs": [
        {
          "title": "Senior Citizen Programs",
          "slug": "senior-citizen-programs",
          "short": "Holistic care, activities, emotional support, and wellness programs for senior citizens.",
          "description": "Vidhatha Society offers comprehensive support programs that uplift, empower, and care for senior citizens through holistic services, emotional support, and community engagement.\n\n---\n\n## Old Age Homes\nOur dedicated Old Age Homes offer a secure, welcoming sanctuary for elderly individuals who require assistance with daily activities or lack family support. These facilities provide:\n\n- Professional medical assistance\n- Nutritiously balanced meals\n- Compassionate companionship\n- 24/7 supervision and safety\n\nBeyond physical care, our environment fosters social connection, emotional well-being, and dignity. Residents participate in cultural programs, recreational activities, and festive celebrations that bring joy, strengthen community bonds, and create cherished memories.\n\n---\n\n## Daycare Center for Senior Citizens\nOur Senior Daycare Centers provide a safe, professionally managed daytime environment for elderly individuals and differently-abled persons. These centers support families who require respite while working or managing other responsibilities.\n\nDaycare services include:\n\n- Recreational and therapy-based activities\n- Social interaction programs\n- Nutritious meals\n- Basic preventive healthcare\n- Cognitive and physical fitness activities\n\nThese centers promote independence, enhance emotional well-being, and create meaningful social connections among participants.\n\n---\n\n## Yoga and Meditation Classes\nOur specialized Yoga and Meditation Programs are crafted for seniors, individuals with disabilities, and community members seeking holistic health benefits.\n\nThese classes help improve:\n\n- Physical flexibility\n- Joint comfort and mobility\n- Balance and fall prevention\n- Mental clarity and emotional calm\n- Stress reduction and relaxation\n\nSessions are tailored for varying physical abilities, ensuring safe and effective practice for all participants while fostering a supportive wellness community.\n\n---\n\n## Counseling Support\nOur Counseling and Mental Health Support Services provide professional psychological assistance to elderly individuals, caregivers, and community members facing challenges such as grief, anxiety, depression, and life transitions.\n\nServices include:\n\n- Private one-on-one counseling\n- Emotional support groups\n- Stress and grief management techniques\n- Personalized coping strategies\n\nThese programs help reduce loneliness, build emotional resilience, restore hope, and strengthen community bonds through shared support and compassionate guidance.\n",
          "images": [],
          "donation_target": 20000
        },
        {
          "title": "Disable People Programs",
          "slug": "disable-people-programs",
          "short": "Support programs, resources, and awareness initiatives for differently-abled individuals.",
          "description": "Special initiatives aimed at providing information about free disabled devices play a vital role in spreading awareness about the availability of assistive technologies, including prosthetics, hearing aids, and mobility aids. These programs educate people with disabilities and their families on how to access these essential tools, enabling them to live more independent and empowered lives.\n\nBy linking individuals to free or subsidized resources, these programs help close the accessibility gap, ensuring that assistive equipment reaches those who need it most. Such initiatives promote inclusivity and encourage disabled individuals to participate fully in society.\n\n---\n\n## Disability-Related Courses\n\nEducational courses and training sessions focused on people with disabilities, their caregivers, and the wider community provide essential skills and knowledge to improve quality of life. These courses cover:\n\n- Rehabilitation methods\n- Use of adaptive and assistive technology\n- Self-care and mobility practices\n- Vocational skills to support employment\n\nThese programs help disabled individuals achieve personal development, self-reliance, and professional advancement, while fostering greater understanding and acceptance within the community.\n\n---\n\n## Competitions\n\nCompetitions designed specifically for disabled individuals offer empowering platforms that build confidence, enhance skills, and promote social interaction. These events can include:\n\n- Sports challenges\n- Art and craft exhibitions\n- Music and cultural performances\n- Technology and innovation contests\n\nBy creating opportunities for participation, these competitions challenge stereotypes, celebrate achievements, and enhance visibility for persons with disabilities.\n\n---\n\n## Distribution of Wheelchairs and Other Mobility Aids\n\nPrograms focused on distributing essential mobility devices—such as wheelchairs, crutches, walkers, prosthetics, and orthotic supports—play a vital role in promoting independence.\n\nBy offering these tools free of cost or at subsidized rates, we help recipients experience:\n\n- Improved mobility\n- Greater comfort and dignity\n- Freedom to participate in daily and community activities\n\nThese initiatives ensure that mobility challenges do not restrict individuals from leading fulfilling lives.\n\n---\n\n## Support Stipends and Assistance\n\nFinancial stipends help reduce the economic burden faced by differently-abled individuals by covering:\n\n- Medical expenses\n- Daily living aids\n- Specialized care or therapy\n\nAdditionally, compassionate assistance with funeral services for disabled individuals ensures their families receive support during times of loss. This aid upholds dignity, respect, and emotional relief for the affected families.\n",
          "images": [],
          "donation_target": 25000
        }

      ]
    },

    {
      "key": "women-youth-child",
      "title": "Women, Youth & Child Empowerment",
      "description": "Empowerment and development programs.",
      "programs": [
        {
          "title": "Women & Child Welfare Programs",
          "slug": "women-child-welfare-programs",
          "short": "Training and assistance for women and children.",
          "description": "Women and child welfare programs strive to enhance the health, education, and overall well-being of women and children, especially in marginalized communities. These initiatives provide access to essential resources such as healthcare, education, nutritious food, and protection, helping to build healthier families and break the cycle of poverty.\n\nEmpowering women with opportunities for learning, skills development, and social support enables them to overcome challenges. Ensuring children receive proper care and education lays a strong foundation for resilient and thriving communities.\n\n---\n\n## Self Help Groups\nSelf Help Groups create spaces for women to connect, share experiences, and advance their financial independence through savings and entrepreneurial ventures. SHGs deliver educational sessions covering financial literacy, health, rights, and business skills, equipping women to manage economic and social challenges confidently while building supportive networks.\n\n---\n\n## Family Counseling\nFamily counseling services provide guidance and emotional support to families navigating marital issues, parenting difficulties, or financial stress. Counselors help improve communication and resolve conflicts, fostering a more harmonious living environment and enabling families to build stronger, more positive relationships.\n\n---\n\n## Rehabilitation Centers\nRehabilitation centers offer structured programs and medical care for individuals dealing with addiction, mental health, or physical recovery needs. These centers provide therapy, counseling, and life skills training that support recovery, personal growth, and reintegration into society.\n\n---\n\n## Counseling Support\nCounseling services support the emotional well-being of elderly individuals, caregivers, and anyone facing mental health challenges. By providing a safe space for sharing and guidance, these programs reduce isolation, promote mental health, and foster a sense of community care.\n\n---\n\n## Pregnant Women Programs\nSpecialized programs for pregnant women offer essential prenatal care, health education, and nutritional guidance. With access to medical services and education on childbirth and infant care, mothers receive comprehensive support for healthy pregnancies and positive maternal and child outcomes.\n\n---\n\n## Nutrition Programs\nNutrition initiatives promote better health for women, children, and the elderly by providing nutritious food, dietary education, and supplements. These programs combat malnutrition and food insecurity, helping vulnerable groups maintain proper growth and long-term wellness.\n\n---\n\n## Daycare Center for Children\nOur daycare center provides a joyful, safe, and stimulating environment where children learn, play, and develop social skills. Through engaging activities and celebrations, dedicated caregivers nurture children’s growth, foster friendships, and help build confidence for future success.\n\n---\n\n## Sanskar Assistance\nSanskar programs offer cultural, spiritual, and moral guidance, helping individuals stay connected to traditions and values. Support for spiritual practices and cultural participation brings mental peace, a sense of belonging, and upholds cultural heritage in the community.\n\n---\n\n## Educational and Wellness Initiatives\n- Abacus and Vedic Maths classes boost mental agility and mathematical skills for children and adults.\n- Yoga sessions for women and children promote fitness, clarity, and emotional balance.\n- Self-protection classes for women teach essential self-defense techniques, encouraging confidence and safety.\n- Our rehabilitation programs provide holistic care and a secure environment for women and children overcoming trauma or addiction.\n\nEach of these initiatives works to empower individuals, strengthen families, and create healthier, confident, and capable communities.",
          "images": [],
          "donation_target": 30000
        },
        {
          "title": "Youth Programs",
          "slug": "youth-programs",
          "short": "Educating and engaging the youth.",
          "description": "Skill development programs equip participants with practical abilities and specialized knowledge to succeed across diverse industries. Training covers IT, technical trades, handicrafts, and communication, building a foundation for employability and economic advancement. These programs promote self-reliance so individuals can pursue varied career paths and financial security.\n\n---\n\n## Personality Development\nPrograms for personality development help individuals build self-confidence, strengthen communication, and develop positive traits such as leadership, emotional intelligence, and problem-solving. Interactive sessions and active exercises teach participants to handle challenges, present themselves effectively, and work collaboratively—preparing them for personal and professional success.\n\n---\n\n## Field Trips\nField trips allow students to engage with the world beyond the classroom, visiting sites like museums, historical locations, and industries. These experiences provide practical learning, inspire curiosity, and reveal real-world applications of academic subjects—broadening students’ perspectives and sparking interest in new career possibilities.\n\n---\n\n## Factory Visits\nSeminars and workshops with factory or industry visits offer hands-on insight into different sectors’ operations. Observing manufacturing, business processes, and interacting with professionals, participants gain practical understanding that connects classroom theory to actual practice, helping them make informed career choices.\n\n---\n\n## Student Counseling\nCounseling services assist students with emotional, academic, and personal challenges such as stress, peer pressure, family issues, and mental health. Offering a confidential space and supportive guidance, counselors help students build resilience, confidence, and motivation, enhancing their academic journey and overall well-being.\n\n---\n\n## Career Guidance\nCareer guidance programs provide targeted advice to help young people identify their talents, interests, and career goals. Through assessments, counseling, and industry exposure, participants make informed decisions about their future, aligning their aspirations with labor market needs for long-term job satisfaction and success.\n\n---\n\n## Education Support\nAcademic support initiatives help students excel by offering tutoring, scholarships, and mentoring. These programs bridge educational gaps, promote equal opportunities, and ensure all learners have access to quality education and resources—empowering every student to reach their goals.",
          "images": [],
          "donation_target": 18000
        },
        {
          "title": "Skill Development Programs",
          "slug": "skill-development-programs",
          "short": "Training the unemployed to become self-sufficient.",
          "description": "Skill development programs equip participants with practical abilities and specialized knowledge to succeed across diverse industries. Training covers IT, technical trades, handicrafts, and communication skills that build a foundation for employability, self-reliance, and long-term economic stability.\n\nBy improving employability, skill development programs contribute to economic growth, personal advancement, and financial independence.\n\n---\n\n## We Offer\n\n### Tailoring & Fashion Training\n- Tailoring\n- Petty Coat & Saree Fall\n- Designer Frocks\n- Nighties Making / Dress Tops\n- Fashion Designing\n- Advanced Fashion Designing\n\n### Embroidery & Handcrafts\n- Hand Embroidery\n- Maggam Embroidery\n- Machine Embroidery\n- Smocking\n- Mehandi Designing\n- Soft Toys Making\n- Flower Bouquet\n- Clay & Cow Dung Idol Making\n- Cow Dung Diyas & Other Crafts\n\n### Household & Small Business Skills\n- Candle Making\n- Snow / Vaseline / Surf / Hand Wash Production\n- Food Processing (Sweets / Snacks / Hots / Jam / Sauce / Papad / Pickles)\n- Rolling / Dry Wash / Polishing\n\n### Traditional & Eco-Friendly Crafts\n- Pottery (Hand / Sand / Pot / Diya)\n- Cloth Bags & Jute Bags Making\n- Agarbathi Making\n\n### Education, Technology & Communication\n- Spoken English\n- Computer Training\n- Mobile Repairing\n\n### Health, Fitness & Self-Protection\n- Yoga\n- Self Protection Techniques\n\n### Music & Creative Arts\n- Music Classes\n\n---\n\nEach course is designed to empower individuals through hands-on training, enabling them to build careers, start small businesses, and contribute meaningfully to society.",
          "images": [],
          "donation_target": 25000
        }
      ]
    },

    {
      "key": "community-rural",
      "title": "Community & Rural Development",
      "description": "Initiatives for better communities and rural progress.",
      "programs": [
        {
          "title": "Rural & Urban Development Programs",
          "slug": "rural-urban-development-programs",
          "short": "Improving infrastructure and supporting rural communities.",
          "description": "Programs include water facility improvement, sanitation awareness, and rural literacy support.",
          "images": [],
          "donation_target": 35000
        },
        {
          "title": "Environmental Protection Programs",
          "slug": "environmental-protection-programs-2",
          "short": "Supporting eco-friendly development.",
          "description": "Additional drives focusing on sustainability, waste reduction, and green lifestyle promotion.",
          "images": [],
          "donation_target": 15000
        }
      ]
    },

    {
      "key": "celebrations-cultural",
      "title": "Celebrations & Cultural Integration",
      "description": "Community bonding through festivals.",
      "programs": [
        {
  "title": "Special Day Celebrations",
  "slug": "special-day-celebrations",
  "short": "Celebrating meaningful days to inspire awareness, unity, and social responsibility.",
  "description": "Special Day Celebrations bring people together to honor and spotlight key causes like World Environment Day, International Women’s Day, and Children’s Day. These occasions feature activities such as tree planting, cultural programs, educational workshops, and community service projects that highlight social, environmental, and humanitarian values.\n\nBy celebrating these days, communities build unity, inspire giving, and motivate people to act for the greater good. These events also recognize achievements and encourage continuous efforts toward positive change.\n\n---\n\n## Spotlight on Key Celebrations\n\n### National Festivals\nMarking occasions like **Independence Day** and **Republic Day** to nurture patriotism and national unity.\n\n### Nutrition Day\nPromoting healthy eating habits and creating awareness of balanced nutrition for better health.\n\n### Cancer Awareness Day\nSharing vital information about preventing, detecting, and treating cancer to support the global fight against the disease.\n\n### Plastic Reduction Day\nAdvocating for sustainable choices and reducing plastic use to protect the environment.\n\n### World Language Day\nCelebrating linguistic diversity and preserving the heritage of different languages and cultures.\n\n### Rashtra Avatarm Day\nHonoring important national milestones and leaders who shaped the nation.\n\n### International and National Days\nObserving global events such as **World Environment Day**, **International Women’s Day**, **World Health Day**, and **Human Rights Day** to address worldwide issues and foster unity.\n\n### Earth Day\nRaising awareness about environmental protection and inspiring sustainable practices for a healthier planet.\n\n### World Water Day\nHighlighting the importance of water conservation and ensuring clean water access for all.\n\n### International Literacy Day\nPromoting literacy and education to empower individuals and reduce poverty.\n\n### World Mental Health Day\nSpreading mental health awareness, breaking stigmas, and offering support to those in need.\n\n### World Yoga Day\nEncouraging holistic wellness through the practice of yoga.\n\n### World Peace Day\nChampioning non-violence, conflict resolution, and global harmony.\n\n### World Environment Day\nA global day of action addressing"
        },
        {
          "title": "Culture, Art and Traditional Programs",
          "slug": "culture-art-traditional-programs-2",
          "short": "Preserving arts and traditions.",
          "description": "Offering cultural classes creates opportunities for individuals to discover and engage with their heritage through language, art, music, and dance. These sessions encourage participants to immerse themselves in traditional practices, helping communities preserve and celebrate cultural identity. Such programs build connections across generations, enrich cultural continuity, and foster a vibrant sense of community pride.\n\n---\n\n### Dance Classes\nDance sessions cover classical, folk, and regional styles, allowing students to experience cultural heritage through movement, rhythm, and storytelling. Learning traditional dance nurtures discipline, creativity, and helps keep age-old practices alive while passing on stories and values through artistic expression.\n\n### Music Classes\nMusic classes introduce students to traditional forms such as Karnatak, Hindustani, and folk music, including vocal techniques and classical instruments like sitar, flute, or tabla. Engaging with cultural music helps preserve rich legacies, develop skills in theory and performance, and deepen appreciation for historical traditions.\n\n### Instrument Classes\nInstrumental training offers hands-on experience with classical instruments—sitar, veena, flute, tabla, drums, string and wind instruments—ensuring endangered musical practices thrive. Learning to play traditional instruments nurtures students’ talents while connecting them with the historical significance and artistry of their culture.\n\n### Arts and Painting\nSpecial arts and painting classes introduce students to traditional crafts such as rangoli, mandala, and tribal painting. These programs encourage creative exploration and cultural appreciation, inspiring young artists to master techniques passed down through generations and preserve unique art forms.\n\n### Idol Making\nIdol making courses teach methods of sculpting religious and cultural figures from materials like clay or stone, passing on skills rooted in spiritual and artistic traditions. By engaging in idol making, students help sustain cultural rituals and festivals while developing respect for crafts and heritage.\n\n### Cultural Competitions\nCompetitions in dance, music, art, and crafts provide platforms for participants to display their talents, pursue excellence, and celebrate cultural traditions. Awards and recognition inspire skill development and keep classic practices vibrant and dynamic, while promoting wider awareness of cultural diversity.\n\n### Workshops and Seminars\nWorkshops and seminars focus on conserving endangered arts, offering expert-led sessions to discuss the value and revival of forgotten traditions. Through interactive learning, participants gain practical skills and help ensure that diverse cultural arts endure for generations to come.",
          "images": [],
          "donation_target": 20000
        }
      ]
    }
  ]
}
